<?php

namespace App;

use Illuminate\Database\Eloquent\Model;

class Production extends Model
{
    /**
     * The attributes that are mass assignable.
     *
     * @var array
     */
    protected $fillable = [
//        № Приказа // Load?
//        Дата контракта
//        Дата завершения контракта
//        Дата подписания актов ввода в эксплуатацию
//        № договора
//        Руководитель проекта // список
//        Заказчик по контракту
//        Наименование проекта
//        Округ
//        Регион 1 (регионы?)
//        Тип услуги
//        Ссылка на закупку
//
//        Обслуживание
//        Роль ЛЦЗ по контракту //список
//        Сумма договора // вручную
//        Период оплаты
//        Поступление оплаты ххх дней (после подписания закрывающих документов)
//        Условия обслуживания по контракту
//        Количество адресов
//
//        Статус проекта
//        Устав проекта // Загрузить Устав
//        Устав проекта // ??
//        Лист открытия проекта // Загрузить ЛОП
//        {
//        //Контрольные сроки по этапам
//        Произвести оборудование (до)
//        СМР начать (не позднее)
//        Монтаж - начать  (не позднее)
//        ПНР – начать (не позднее)
//
//        Крайняя дата поставки
//        СМР завершить (не позднее)
//        Монтаж- завершить (не позднее)
//        ПНР – завершить (не позднее)
//        }

    ];
}
